In [ ]:
import pandas as pd
df=pd.read_csv("employee.csv")
df.head()

   emp_id     name department  age  salary  hire_year       city
0       1    Alice         IT   28   60000       2021  Bangalore
1       2      Bob         HR   35   50000       2019      Delhi
2       3  Charlie         IT   30   70000       2020  Hyderabad
3       4    David    Finance   45   90000       2015     Mumbai
4       5      Eva         HR   26   48000       2022       Pune

In [4]:
import pandas as pd
df=pd.read_csv("employee.csv")
df.head()
df.columns
df.shape
df.isnull().sum()

emp_id        0
name          0
department    0
age           0
salary        0
hire_year     0
city          0
dtype: int64

In [5]:
import pandas as pd
df=pd.read_csv("employee.csv")
df.head()
df.columns
df.shape
df.isnull().sum()
df.head(10)
df.tail(5)

    emp_id   name department  age  salary  hire_year       city
45      46  Tracy         HR   29   53000       2021  Bangalore
46      47   Uday    Finance   35   80000       2019      Delhi
47      48   Vera  Marketing   38   65000       2016     Mumbai
48      49   Will         IT   41   88000       2015       Pune
49      50   Zara         HR   32   57000       2020    Chennai